<template>
  <v-card
    class="mx-auto"
    outlined
  >
    <v-card-text>
      <div class="body-1">
        연구 참여자 동의서
      </div>
      <div class="terms pa-2">
        ▶ 연구배경
        <br />
        원격 교육은 기술 발전을 기반으로 미디어의 변화와 함께 진화해 왔다. 원격 교육은 통신을 통한 학생과
        교사 간의 교수 및 학습에서 시작되어 1720년대부터 현재까지 꾸준히 발전해, 현재는 교육분야 기술의
        성장 및 AI의 확립으로 인하여 지리적, 시간적 거리의 한계에도 불구하고 학습자는 매체를 통해 교사 및
        기관과 연결되고 언제 어디서나 자율적으로 학습할 수 있는 환경이 조성되었었다. 이 때 학습 및
        COVID-19와 같은 외부 환경 영향이 있어 온라인 수업에 대한 수요가 꾸준히 증가하고 있지만, 높은
        미이수율과 이수율이 보고되고 있다. 많은 연구자들이 온라인 수업을 성공적으로 이끌기 위해서는
        동기부여가 중요한 요소라고 언급했듯이 온라인 수업에서 학생들에게 동기를 부여하는 방법을 찾는
        것은 매우 중요하다. 또한 웹상에서 어떤 요인이 학생들에게 동기를 줄 수 있는지 알아낼 필요가 있다.
        <br />
        <br />
        ▶ 연구방법
        <br />
        본 실험에 참가할 경우 피험자들은 약 10분 간 인공지능 에이전트와 함께 기초 불어학습을 진행한다.
        실험에 사용되는 인공지능 소프트웨어는 해당 학습을 위해 자체 개발된 상품의 프로토타입으로서,
        사용자의 학습과정에 참여하여 서로 상호작용 할 수 있을 뿐만 아니라, 사용자의 학습패턴 및 결과를
        분석할 수 있다. 본 연구에서는 웹사이트를 통해 불어단어 학습 및 이에 대한 단어시험을 실시하며, 실험
        도중 에이전트가 지시하는 내용 이외의 질문이나 발언은 할 수 없다. 실험 이후 설문지 작성하게 되며
        설문 소요시간은 약 10분이다.
        <br />
        <br />
        ▶ 연구에 참여하면 얻게 되는 이득
        <br />
        피험자는 실험참여 및 설문작성 이후 4,000원 상당의 스타벅스 커피 기프티콘을 지급받는다. 실험을
        통해 얻은 피험자의 결과는 연구를 위한 자료로 활용된다는 점에서 학술적 의미가 있으며, 추후 교육용
        에이전트 디자인을 개선하는데 도움을 준다는 점에서 실용적 가치를 갖는다.
        <br />
        <br />
        ▶ 연구 준수사항
        <br />
        본 연구에 동의하면, 실험에 대한 안내를 받게 됩니다. 안내문을 꼼꼼히 읽고 질문이 있을 경우 연구자에게
        질문해주시기 바랍니다. 안내문을 읽은 후에는 본 실험을 수행하게 됩니다. 과제에 성실히 응해주시기
        바랍니다.
        <br />
        <br />
        ▶연구기간 및 전체 연구 참여자 수
        <br />
        본 연구는 2021년 10월 27일부터 2022년 10월 25일까지 진행될 예정입니다, 실험은 올해 10월 26일부터
        11월 10일까지 총 16일간 참가자 100명을 대상으로 시행할 예정입니다.
        <br />
        <br />
        ▶연구에 참여해서 추가적으로 발생 되는 비용은 없습니다.
        <br />
        <br />
        ▶연구에 참여해서 직접적으로 지급되는 보상이나 혜택
        <br />
        본 연구에 참여하시면, 실험 사례로 4,000원 상당의 스타벅스 커피 기프티콘을 지급받게 됩니다. 실험이
        완료되면 모든 행정 처리를 거쳐 기입하신 계좌로 입금될 것입니다. 단, 실험 시작 전에 참여를 거부하시면,
        사례비는 지급되지 않습니다. 하지만 이 밖에 실험 도중 다치거나 피해를 입는 상황, 불편감으로 인한 실험 중도
        포기, 혹은 실험 완료 이후에 실험 참여 거부와 같은 경우에는 이를 입증할 수 있는 증거 제시 시 실험비가
        지급될 예정입니다.
        <br />
        <br />
        ▶자발적 참여 및 참여 거부와 철회의 사유
        <br />
        본 연구에 대한 참여 여부는 전적으로 귀하의 의사에 따라 결정하시면 됩니다. 만일 본 연구에 참여하기를
        원하지 않으시면 동의하지 않으셔도 되며, 동의 후에도 언제든 연구자에게 중지를 요청할 수 있습니다. 중도
        포기를 포함한 어떠한 경우에도 귀하에게 불이익은 없을 것입니다. 중도 철회 시 실험 참여 중 수집한 귀하의
        모든 정보는 즉시 파기됩니다.
        <br />
        <br />
        ▶ 개인 정보의 비밀 보장
        <br />
        본 연구의 결과 보고서나 출판물에서, 귀하의 개인정보는 비밀로 유지될 것이며 법에 따라 보호될 것입니다.
        <br />
        <br />
        ▶ 연구대상자로서의 권익에 관한 정보 제공
        <br />
        본 연구는 성균관대학교 기관윤리심의위원회(IRB)에 의해 검토되고 승인되었습니다. 만약 귀하의 권익에
        피해를 주는 정보가 발생하는 경우, 연구자들은 즉시 알려드릴 것입니다. 본 연구에 대한 질문사항이나 궁금한
        점은 첫 페이지 상단의 연구자 연락처를 통해 언제든 문의하실 수 있으며, 연구참가자의 권리 침해에 대해
        문의할 사항이 있으시면 "성균관대학교 공동 기기원 행정실 연구윤리 담당자 (TEL 031-299-6711)"에
        연락하실 수 있습니다.
      </div>
      <div class="body-1 d-flex justify-end mb-5">
        <v-checkbox
          v-model="agreedTerm1"
          label="동의합니다"
        />
      </div>

      <div class="body-1">
        개인정보에 대한 비밀보장
      </div>
      <div class="terms pa-2">
        실험 참여자는 실험 시작 후 실험 참여비 지급을 위한 개인 정보 (이름, 연락처, 주민번호, 계좌 정보,
        소속) 에 대한 내용을 기입한다. 이는, 본교 관할 세무서에 통보하는 목적과 실험 참여 비 지급 이외에 그
        어떠한 목적으로 활용되지 않는다. 또한 참여자는 간단한 설문조사를 통해 해당 주제와 유사한
        어플리케이션 또는 에이전트에 대한 사용경험 여부를 조사한다. 수집된 개인정보는 연구 결과를
        분석하는 자료로 사용된다. 이와 같이 수집된 모든 피험자들의 정보는 연구 번호를 부여하고, 전산화
        하며, 종이 자료는 모두 파기한다. 전산화된 관련 자료는 연구 책임자와 연구 참여자만 열람할 수 있도록
        MS Dropbox 에 암호화 하여 3년 동안 저장한다. 저장된 기록은 3년 후인 2023년 6월에 모두
        삭제한다.
      </div>
      <div class="body-1 d-flex justify-end mb-5">
        <v-checkbox
          v-model="agreedTerm2"
          label="동의합니다"
        />
      </div>

      <div class="body-1">
        개인정보 수집의 동의 여부
      </div>
      <v-radio-group v-model="selectedOption1">
        <v-radio
          label="특성상 필요하므로 개인정보 제공에 동의합니다."
          value="특성상 필요하므로 개인정보 제공에 동의합니다."
        />
        <v-radio
          label="개인정보가 수집되는 것에 동의 못하므로 연구에 참여하지 않겠습니다."
          value="개인정보가 수집되는 것에 동의 못하므로 연구에 참여하지 않겠습니다."
        />
      </v-radio-group>
      <br />

      <div class="body-1">
        자료의 추가사용에 대한 동의
      </div>
      <div>
        본 실험을 통해 얻어진 귀하의 자료는 향후의 다른 연구에서도 사용되어 더 가치 있는 연구의 결과로 사용 될 수
        있습니다. 귀하의 자료를 미래의 다른 연구에 사용하는 것에 대해 다음 중 하나에 선택해 주시기 바랍니다.
      </div>

      <v-radio-group v-model="selectedOption2">
        <v-radio
          label="향후의 모든 다른 연구에 제 자료를 제공하여 연구하는 것에 동의합니다."
          value="향후의 모든 다른 연구에 제 자료를 제공하여 연구하는 것에 동의합니다."
        />
        <v-radio
          label="성균관대학교의 연구자에게만 동의합니다."
          value="성균관대학교의 연구자에게만 동의합니다."
        />
        <v-radio
          label="본 연구의 연구자에게만 동의합니다."
          value="본 연구의 연구자에게만 동의합니다."
        />
        <v-radio
          label="동의하지 않습니다."
          value="동의하지 않습니다."
        />
      </v-radio-group>

      <v-text-field
        v-model="participantID"
        label="참여자 성명/휴대전화 번호 마지막 4자리 (ex: 홍길동/1234)"
      />
    </v-card-text>

    <v-card-actions>
      <v-btn
        block
        color="primary"
        :disabled="!agreedAll"
        @click="submit"
      >
        다음
      </v-btn>
    </v-card-actions>
  </v-card>
</template>

<script>
/* eslint-disable import/no-unresolved */
import { mapMutations } from 'vuex';

export default {
  data: () => ({
    agreedTerm1: false,
    agreedTerm2: false,
    selectedOption1: null,
    selectedOption2: null,
    participantID: '',
    round: 0,
  }),

  computed: {
    agreedAll() {
      return this.agreedTerm1
        && this.agreedTerm2
        && (this.selectedOption1 && this.selectedOption1 !== '개인정보가 수집되는 것에 동의 못하므로 연구에 참여하지 않겠습니다.')
        && (this.selectedOption2 && this.selectedOption2 !== '동의하지 않습니다.')
        && (this.participantID && this.participantID.length >= 5 && this.participantID.indexOf('/') !== -1);
    },
  },

  mounted() {
  },

  methods: {
    ...mapMutations([
      'updateFields',
    ]),

    submit() {
      this.updateFields(this.$data);
      this.$router.push({ name: 'Explanation' });
    },
  },
};
</script>

<style lang="scss">
.terms {
  height: 150px;
  overflow-y: auto;
  border: 1px solid grey;
}
</style>
